start_answer = """
Привет, {first_name} 👋
Я персональный чат-бот с искусственным интеллектом, способный работать в диалоговом режиме, повторяющий возможности ChatGPT.
Нажми /help, чтобы получить информацию о моих командах."""

help_answer = """
Команды:

ℹ /about - обо мне.
💰 /balance - проверить баланс.
💳 /buy - пополнить баланс.
🔄 /forget - очистить память нейросети.
🖌️ /image - сгенерировать изображение по текстовому запросу.

Все остальные сообщения будут восприниматься как запрос к ChatGPT.

❗️Прежде чем сменить тему общения с ботом или перейти на другой язык, нажмите /forget."""
