start_answer = """
Привет, {first_name} 👋
Я персональный чат-бот с искусственным интеллектом, способный работать в диалоговом режиме, повторяющий возможности ChatGPT.
Нажми /help, чтобы получить информацию о моих командах."""

help_answer = """
Команды:

ℹ /about - обо мне.
💰 /balance - проверить баланс.
💳 /buy - пополнить баланс.
🔄 /forget - очистить память нейросети.
🖌️ /image - сгенерировать изображение по текстовому запросу.

Все остальные сообщения будут восприниматься как запрос к ChatGPT.

❗️Прежде чем сменить тему общения с ботом или перейти на другой язык, нажмите /forget."""

about_answer = """
ChatGPT — чат-бот с искусственным интеллектом, способный работать в диалоговом режиме, поддерживающий запросы на естественных языках.
ChatGPT может вести диалог, отвечать на вопросы любой сложности, писать код на разных языках программирования, искать ошибки в коде, сочинять стихи, писать сценарии и многое другое.
ChatGPT может использовать в общении разные языки, но мы рекомендуем вести общение на английском. Так бот будет работать более корректно, а вы сможете сэкономить свои токены (1000 токенов ~ 700 английских слов или 150 слов другого языка)."""

forget_answer = """
Вы успешно очистили память бота!"""
